comp-sci/idioms.org
#+TITLE: Idioms and Heuristics in Programming
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2021-02-15T11:07:41-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
# Created Monday February 15, 2021 at 11:07AM

* DAMP and DRY code

** DRY = "Don't Repeat Yourself"

- Refactor production code to avoid duplicated code

** DAMP = "Descriptive and Meaningful Phrases"

- For DSL, DRY may produce unsatisfactory code (less readable, harder to
  maintain business logic, etc)
- Hence we would prefer /descriptive and meaningful phrases/ in our DSL
- For unit tests, we also prefer DAMP code
- The acronym "DAMP" seems to have been coined with DSLs in mind by
  [[http://blog.jayfields.com/2006/05/dry-code-damp-dsls.html][Jay Fields]] (May 9, 2006)