docs/comp-sci/idioms.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Idioms and Heuristics in Programming</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Idioms and Heuristics in Programming</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-3b2a8f55-36a3-45ff-aeab-1a2563a47db8">1. DAMP and DRY code</a>
<ul>
<li><a href="#h-bd662bc8-906f-46e3-a735-af65dd13317b">1.1. DRY = "Don't Repeat Yourself"</a></li>
<li><a href="#h-d7a2cc8f-d6b5-459a-8662-e466f8f1a0a5">1.2. DAMP = "Descriptive and Meaningful Phrases"</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-3b2a8f55-36a3-45ff-aeab-1a2563a47db8" class="outline-2">
<h2 id="h-3b2a8f55-36a3-45ff-aeab-1a2563a47db8"><span class="section-number-2">1.</span> DAMP and DRY code</h2>
<div class="outline-text-2" id="text-h-3b2a8f55-36a3-45ff-aeab-1a2563a47db8">
</div>
<div id="outline-container-h-bd662bc8-906f-46e3-a735-af65dd13317b" class="outline-3">
<h3 id="h-bd662bc8-906f-46e3-a735-af65dd13317b"><span class="section-number-3">1.1.</span> DRY = "Don't Repeat Yourself"</h3>
<div class="outline-text-3" id="text-h-bd662bc8-906f-46e3-a735-af65dd13317b">
<ul class="org-ul">
<li>Refactor production code to avoid duplicated code</li>
</ul>
</div>
</div>
<div id="outline-container-h-d7a2cc8f-d6b5-459a-8662-e466f8f1a0a5" class="outline-3">
<h3 id="h-d7a2cc8f-d6b5-459a-8662-e466f8f1a0a5"><span class="section-number-3">1.2.</span> DAMP = "Descriptive and Meaningful Phrases"</h3>
<div class="outline-text-3" id="text-h-d7a2cc8f-d6b5-459a-8662-e466f8f1a0a5">
<ul class="org-ul">
<li>For DSL, DRY may produce unsatisfactory code (less readable, harder to
maintain business logic, etc)</li>
<li>Hence we would prefer <i>descriptive and meaningful phrases</i> in our DSL</li>
<li>For unit tests, we also prefer DAMP code</li>
<li>The acronym "DAMP" seems to have been coined with DSLs in mind by
<a href="http://blog.jayfields.com/2006/05/dry-code-damp-dsls.html">Jay Fields</a> (May 9, 2006)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sun, 11 Apr 2021 13:49:05 -0700
</div>
</body>
</html>
